'''
1.短信通知 余额提醒 打印流水
2.打印流水
传参个数可以确定? 不确定传参个数的情况下---不定长参数
'''

# def qu_qian(money, *fuwu):
#     print('===== 中国建设银行 ATM =====')
#     print('业务:快速取款')
#     print(f'金额:{money}元')  # 函数里面的代码是多变的--参数
#     print(f'您选取的服务有:{fuwu}')
#     print('请取走你的现金')
#     print('---------------------------')


# qu_qian(2000, '短信通知', '余额提醒', '111')
# qu_qian(2000,)

'''
**:数据类型是字典---键值对
'''


def qu_qian(money, **fuwu):
    print('===== 中国建设银行 ATM =====')
    print('业务:快速取款')
    print(f'金额:{money}元')  # 函数里面的代码是多变的--参数
    print(f'您选取的服务有:{fuwu}')
    print('请取走你的现金')
    print('---------------------------')


qu_qian(100, 短信通知='VIP用户参与好礼,参加活动赢赢得活动好礼', 余额提醒='您的余额为0')
