s = '甲乙丙丁戊己庚辛'
'''
# 通知前五个人来领取🍿
# 字符串[开始索引:结束索引:步长]
# 结束索引娶不到,结束索引当前的值+1 ---(左闭右开)
# 开始索引不写:默认是从0开始
# 结束索引不写:默认是最后一个值
# 步长:间隔有规律的取值,当步长为正数，取值方向默认从左往右依次取值，当步长为负数，取值方向从右往左
'''
# print(s[:5])
# print(s[5:10])
# print(s[:])  # 甲乙丙丁戊己庚辛
# print(s[:11])  # 切片，不存在索引越界问题，有多个值，取多少个


# print(s[::1])  # 开始索引跟结束索引没有写，默认就是全部
# print(s[::2])  # 步长为2，隔一个取一个
# print(s[::3])  # 步长为3，隔两个取一个

# 反向取值
# print(s[-1:-6:])  # 步长默认为1，步长取值方向:从左往右依次取值
# print(s[-6:-1:])  # 步长默认为1，步长取值方向:从左往右依次取值
# 反着取值---从右往左取值---步长只能为负数
print(s[-1:-6:-1])
# 如果我想反着取全部内容
print()  # [::-1] [-1:-11:-1] [-1::-1]
print(s[-1:-11:-1])  # [::-1] [-1:-11:-1] [-1::-1]
print(s[-1::-1])  # [::-1] [-1:-11:-1] [-1::-1]
