# 关于在引号里的内容，原样输出
'''
字符串跟字符串之间可以做相加运算---相加其实是字符串的拼接
整数和字符串之间不能做相加
TypeError: unsupported operand type(s) for +: 'int' and 'str'
类型错误     不支持               类型            int       str
'''
# print("1+1")  # 1+1
# print("1" + "1")  # 11
# print("1" + "34")  # 134
# print("a" + "b")   #
# print(1 + "2")   #

'''
*:乘法符号
字符之间是不能做乘法运算的
下上文的分隔符
---------------------
学生管理系统
----------------
'''
# print("1" * 2)
# print("❤️" * 6)  # ❤❤❤❤❤❤️
# print("😄" * 7)  # 😄😄😄😄😄😄😄
# print("😄😭" * 9)  # 😄😭😄😭😄😭😄😭😄😭😄😭😄😭😄😭😄😭
print('-' * 40)
print(' ' * 10 + "学生管理系统")
print(' ' * 10 + "1. 添加学生")
print(' ' * 10 + "2.修改学生信息")
print('*' * 40)
