'''
开发一个网站:
用户注册---注册个人信息---用户
对于灵活的信息---不能写死---接收用户输入的内容

print:输出函数 将计算机结果展示出来给用户看
input:输入函数   将用户输出的信息给计算机
'''

# 要求用户输入，需要给提示信息，填写在括号里
# 当我们输入完了内容,一定要及得回车,代表你已经输入完
# 想要将出入的内容保存起来   用变量
# 多input执行:必须签一个输入完成,后一个input才能执行
# name = input('请输入你的姓名:')  # input:输入函数，正在等待你的输入
# phone = input('请输入你的电话号码:')  # input:输入函数，正在等待你的输入
# print(name, phone)

'''
对于你输入的内容不可控-----干脆给你输入的内容统一转换成字符串
'''
num1 = float(input('请输入数字1:'))
num2 = float(input('请输入数字2:'))
print(num1 + num2)  # 3
print(num1 - num2)  # 3
'''
1.input函数,括号里面一定要写提示信息
2.多个input函数，必须是输入了一个信息才能进入下一个input
3.回车确认你输入完毕
4.输入的内容默认都是字符串类型
5.对于输入的内容想要保存---用变量保存
'''