'''
如果人脸匹配成功---开门
否则匹配失败---拒绝开门
'''
# match = True  # 人脸匹配成功
# if match:  # 判断条件---
#     print('✅️人脸校验成功,欢迎回家!')
# else:
#     print('❌️人脸不匹配,禁止通行,请重新验证')

'''
如果年龄是>=18,可以进入网吧
否则请出去
'''
# age = int(input('请输入年龄:'))  # input默认接收的是字符串类型的数据
# if age >= 18:  # age>=18---if True False
#     print('可以进入')
# else:
#     print('不好意思,未成年,不允许进入')

# age = int(input('请输入年龄:'))  # input默认接收的是字符串类型的数据
# if age >= 18:  # age>=18---if True False
#     print('可以进入')
#
# print('不好意思,未成年,不允许进入')
# 不管if这个条件是否成立,这个代码都会执行
'''
正确的账号:admin
正确的密码:123456
模拟用户登录的一个功能
1.用户首先得输入账号
2.用户得输入密码
3.判断账号跟密码是否正确
如果正确的情况下,提示登录成功,不正确的情况,提示 账号或密码错误,登录失败
'''
# 用户
user = input('请输入你的账号')
# 密码
pwd = input('请输入你的密码:')
# 判断是否输入的在正确的账号密码
# user == 'admin'    pwd==' 123456'
if user == 'admin' and pwd == '123456':
    print('恭喜!登录成功')
else:
    print('抱歉,账号或密码错误,登录失败')
