'''
不可变的数据类型
   1.数值(int,float,bool)
   2.字符串
可变的数据类型
   1.列表
'''
# 多个元素之间是用英文逗号隔开
# lst = ['星空', '20 123124，湖南', True]

'''
查:获取列表里面的数据
   0        1          2         3      4
['CEO浅', '总经理兵', '财务心', '运营从', '业务米']
  -5        -4         -3       -2       -1
'''
# 信息    IndexError:list index out of range(列表他的索引超出了范围)
info = ['CEO浅', '总经理兵', '财务心', '运营从', '业务米']

# 第3个座位他的职位是什么: 查 获取列表中第三个值
# 列表 [索引]
# print(info[2])
# print(info[-3])
# print(info[9])
# 后面三个座位分别为什么职位---切片
'''
切片:[开始索引:结束索引:步长]
开始索引:表示从哪个位置开始获取，默认是从0开始
结束索引:表是从哪个位置结束(结束位置不包含,只能取到他的一个位置),默认是取全部
步长:决定了取值方向和间隔规律取值,默认为1,依次取值
   正向:默认的取值方向从左到右
   负向:默认的取值方向从右向左
'''
print(info[2:])  # 结束索引没有写，默认就是取到最后
print(info[2:5])  # 当前索引位置是取不到了，只取到前一位
print(info[-3:])  # -3 反向
print(info[-3:-4:-1])  # -3
# 列表位置全部重新排---全部反过来
print(info[::-1])
print(info[-1:-6:-1])
print(info[-1::-1])

print(info[1:20])  # 有多少取多少，切片不会出现索引越界的问题
