'''
输出10个Hello world
对于你需要重复执行的代码----循环

循环次数
n = 1, n<=10
n = 10,n<=19

while 循环的条件
    你需要重复执行的代码

第一个:初始值的设定
第二个:条件设定
第三个:初始值的变化
'''

'''
第1次循环
  n = 1---1<=10 True
第2次循环
  n = 1---1<=10 True
第3循环
  n = 1---1<=10 True
  
初始值的变化---取决于你循环的次数--10
1 3 5 7 9 11
'''
n = 1
while n <= 10:
    print('Hello world')
    n = n + 1

'''
第一次循环
   n = 1---1<=10 True
   n = 1 + 2
第二次循环
   n = 3-----True
   n = 3 + 2
第三次循环
   n = 5-----True
   n = 5 + 2
第四次循环
   n = 7-----True
   n = 7 + 2
第五次循环
   n = 9-----True
   n = 9 + 2
第六次循环
   n = 11<=10-----False
循环结束
'''
