# 其中某一个值，在后续的代码当中可能会连续用的
# 求证浅安的年龄 20 (100行---18---指的是年龄吗)
'''
我今年的年龄是: 字符串类型(str)文本类型
18:整数
多个值之间用逗号隔开
'''
print("我今年的年龄是:", 18, "岁")
print("浅安的年龄是:", 18)
print("老师的年龄是:", 18)
print("133期的年龄是:", 18)

'''
既然这个值是反反复复使用的:现将这个值保存起来,
后续要用,获取下来
写作文--我的妈妈---直接拿来使用
'''
# 变量名不能加引号，加了引号他就是一个固定的值
# 给这个值起了个名字
# 变量名 = 具体的值
# a = 1
# b = 2
# c = 3
# print(c)
a = 20  # 年龄
'''
'a'---固定的字符--a值
对于变量名--一定不能加引号
对于变量来说，必须在使用前做定义
代码是从上到下依次运行
'''
b = '顺德区啊撒大声地'
print("我的名字是:", b)
print("浅安的年龄是:", a)
print("老师的年龄是:", a)
print("133期的年龄是:", a)
