'''
算数运算符:认识他，计算---电脑帮你计算
+:相加,两个数之间做相加运算
-:相减,两个数之间做相减运算
*:乘法,2x3
/:除法，两个数之间做相除运算


'''
print(132312321 + 213123123)
print(132312321 - 213123123)
print(132312321 * 213123123)
print(132312321 * 2)
print(10 / 2)  # 5.0 统一float类型
# print(10 / 0)  # 没有意义，会报错
# 精确度误差的问题-- 计算机进制的转换
# 计算机只能认识01---010101010000111
# decimal:精确计算
print(10 / 3)  # 3.33333333333335

'''
整除:直接取整数部分(向下取整)
得到结果相邻的两个整数---取比结果小的整数
-1 -1.666666666667 -2
'''
print(-10 / 6)
print(-10 // 6)

'''
%:取余
10颗糖---平均分给三个小朋友---还剩一颗
去判断奇偶数
对于奇数/2---1
对于偶数/2---0
'''
print(10 % 3)  # 1
print(10 % 2)  # 0

print(12312321312 % 2)  # 余数为0---偶数

'''
求次方---幂运算
**
2**2---2x2
2**3---2x2x2
2**4---2x2x2x2


5的2次方:5**2
'''
print(5 ** 2)  # 5x5
