info = ('米儿', '女', 20, '市场部', '24243', 168.8, False, ['python'])

# 索引从0开始
print(info[0])

# 市场部
print(info[3])

# 最后一组值
# print(info[-1])
# print(info[20])  # tuple index out of range  索引越界
# print(info[1:3])
'''
[开始索引:结束索引:步长]
开始索引默认从0开始
结束索引默认取完最后一个值，写了指定的结束索引，只能去到前一个值
'''
print(info[::-2])  # 倒着各一个取一个
info = ('米儿', '女', 20, '市场部', '24243', 168.8, False, ['python', '美食'])
# 列表---可变的数据类型 美食这个值
# print(info[-1][1])
info[-1][0] = 'AI应用'
print(info)   # 元组数据类型不支持修改,直接给你报错

'''
60--试卷成绩+平时成绩
(89,90,89,[213,123])
'''