'''
绝对路径:E:\AI大模型\第二阶段python\pythonProject\第16节课\img.png
相对路径:img/img.png

txt 文档里面写入内容
1.打开文件
2.对文件里面的内容进行读/写
美国---不会考虑中文---ASCII编码---utf-8编码--gbk编码
计算机只认识01,不问人事汉字,字母
编码:将认识的汉字,字母,字符---计算机认识的01
解码:将计算机认识的01---我们认识的汉字,字母

不同的编码
{'01101010':'你'}
{'01010101':'好'}
GBK:国内早期中文编码,专门为中文设计(乱码的问题)
unicode家族:做全世界所有文字的大字典
'''

# 文件读操作
'''
1.文件路径
2.文件模式
3.编码格式
FileNotFoundError: [Errno 2] No such file or directory: 'aa.txt'
文件 没  找到  错误             没      文件  或  路径        aa.txt


文件的指针:文件的光标
'''
# 读取一个不存在的文件---报错
f = open('aaa.txt', 'r', encoding='utf-8')
# 读
print(f.read())  # 读取你这个文件里面所有的内容
# 让光标从头开始
f.seek(0)
print(f.read())  # 读取你这个文件里面所有的内容
