'''
''.join(需要拼接的数据):返回的数据类型是字符串数据类型,列表里面的元素值全部是字符串类型,有数字会直接报错
'''

lst = ['张三', '李四', '王五', '八1千一', '建建', '但行好事', '不开心', '欲']
'''
名字做提取---做拼接
张三,李四,王五
'''
# print(lst[0]+','+lst[1]  )
# print(','.join(lst[1:4]))
# print('|'.join(lst[1:4]))
# print('😭'.join(lst[1:4]))
lst1 = [19, 12, '张三', '李四', '王五', '八1千一', '建建', '但行好事', '不开心', '欲']
# lst1[0] = '19'
# lst1[1] = '12'
# print(','.join(lst1))

'''
sort:排序(默认从小到大)----从大到小排序
列表他是一个可变的数据类型,直接修改了列表里面的值
'''
lst2 = [12, 34, 56, 78, 90, 110, 12, 235, 234234, 234235, 567]
# 一键排序 reverse=False---默认没有开启翻转
lst.sort(reverse=True)  # 开启反转
print(lst2[::-1])
print(lst2)
