'''
比较运算符---最终 True/False(bool--布尔)
一个等号 赋值
a = 1
== :判断两个值是否相等


'''
# print(3 == 5)  # False
# print(3 == 3.0)  # True
# print(3 >= 2)  # 3>2或者3==2
# print(3 >= 3)  # 3>2或者3==2
# print(10 == '10') # False
# print(10 > '9') # 类型不一样

# print(3 != 4)
#  字符串跟字符串之间可以做比较---可以
'''
字符串之间作比较,单个字符单个字符作比较
'1' > '2':False
'1' > '0':
ASCII编码
01011010
    -  
    人
编码:将人类能理解的文字数据信息转化成计算机能理解的
解码:将计算机能理解的数据文字转换成人类能理解的
'''
print('19' > '20') # False
print('19' > '02')  # True
'''
97>49
'''
print('a' > '12')   # True
print('你好' > '时间')
